app/controllers/admin/incomes_controller.rb

    def index
      @incomes = Income.all
---
SELECT "incomes".* FROM "incomes"

    def create
      @income = Income.new(income_params)

      respond_to do |format|
        if @income.save
---
INSERT INTO "incomes" ("user_id", "incometable_type", "incometable_id", "amount", "date", "note", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

      def set_income
        @income = Income.find(params[:id])
---
SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = $1 LIMIT $2  [["id", 980190963], ["LIMIT", 1]]

      def set_incometables
        @incometables = TypeIncome.all + TypeIncomesUser.all
---
SELECT "users".* FROM "users"
SELECT "type_incomes".* FROM "type_incomes"
SELECT "type_incomes_users".* FROM "type_incomes_users"