app/controllers/admin/payment_methods_controller.rb

SELECT "payment_methods".* FROM "payment_methods"
---
    def index
      @payment_methods = PaymentMethod.all

INSERT INTO "payment_methods" ("name_fr", "name_en", "name_es", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name_fr", "Test_fr"], ["name_en", "Test_en"], ["name_es", "Test es"], ["created_at", "2024-12-28 21:30:25.656570"], ["updated_at", "2024-12-28 21:30:25.656570"]]
---
    def create
      @payment_method = PaymentMethod.new(payment_method_params)

      respond_to do |format|
        if @payment_method.save

SELECT "payment_methods".* FROM "payment_methods" WHERE "payment_methods"."id" = $1 LIMIT $2  [["id", 980190963], ["LIMIT", 1]]
---
      def set_payment_method
        @payment_method = PaymentMethod.find(params[:id])