app/controllers/admin/type_incomes_controller.rb

SELECT "type_incomes".* FROM "type_incomes"
---
    def index
      @type_incomes = TypeIncome.all