app/views/admin/incomes/_form.html.erb

    <%= form.label :user_id %>
    <%= form.collection_select(:user_id, User.all , :id, :name) %>
---
SELECT "users".* FROM "users"